In [27]:
#importing Required modules
import pandas as pd
from cassandra.cluster import Cluster
from cassandra.query import dict_factory

In [28]:
#connection to cluster
cluster=Cluster(['127.0.0.1'],port=9042)

In [29]:
#my_keyspace is a keyspace done using cqlsh command line 
session=cluster.connect('my_keyspace')

In [60]:
#to create a keyspace here
session.execute('''CREATE KEYSPACE my_keyspace2 WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 1};''')

In [61]:
session.execute('''USE my_keyspace2;''')

In [62]:
#Creating table songs with required attributes
session.execute('''CREATE TABLE songs(song_title varchar PRIMARY KEY,artist_name varchar,year date, album_name boolean,single varchar);''')
print("done")

done

In [63]:
#Inserting Values
session.execute('''INSERT INTO songs(song_title,artist_name,year,album_name,single) VALUES ('Across The Universe','The Beatles','1970',False,'Let It Be');''')
print("done")

done

In [43]:
session.execute('''INSERT INTO songs(song_title,artist_name,year,album_name,single) VALUES ('The Beatles','Think For Yourself','1965',False,'Rubber Soul');''')
print("done")

done

In [30]:
session.row_factory=dict_factory

In [44]:
#We can obsereve that rows retured are cassandra objects hence we can convert them to pandas dataframe
rows=session.execute('select * from songs')

In [45]:
print(rows[0])

{'song_title': 'The Beatles', 'album_name': False, 'artist_name': 'Think For Yourself', 'single': 'Rubber Soul', 'year': Date(-2147481683)}

/tmp/ipykernel_16361/990529502.py:1: DeprecationWarning: ResultSet indexing support will be removed in 4.0. Consider using ResultSet.one() to get a single row.
  print(rows[0])

In [46]:
df=pd.DataFrame(rows[:])
df

,song_title,album_name,artist_name,single,year
0,The Beatles,False,Think For Yourself,Rubber Soul,-2147481683
1,Across The Universe,False,The Beatles,Let It Be,-2147481678

In [58]:
#executing required query
req_row=session.execute('''select * from songs WHERE year=1970 AND artist_name='The Beatles' ALLOW FILTERING ''')
print("done")

done

In [59]:
df=pd.DataFrame(req_row[:])
df

            song_title  album_name  artist_name     single         year
0  Across The Universe       False  The Beatles  Let It Be  -2147481678